app/views/achievement_standards/_form.html.erb

SELECT "years".* FROM "years"
---
    <%= f.label "Year Level" %>
    <%= f.select :year_id, Year.all.collect { |y| [ y.label, y.id ] }, include_blank: true %>

SELECT "learning_areas".* FROM "learning_areas"
---
    <%= f.label "Learning Area" %>
    <%= f.select :ylearning_area_id, LearningArea.all.collect { |l| [ l.name, l.id ] }, include_blank: true %>