app/controllers/achievement_standards_controller.rb

    def create
        AchievementStandard.create achievement_standard_params
---
INSERT INTO "achievement_standards" ("description", "knowledge", "skills", "understanding", "created_at", "updated_at", "year_id", "learning_area_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def index
        @achievement_standards = AchievementStandard.all
---
SELECT "achievement_standards".* FROM "achievement_standards"

    def edit
        @achievement_standard = AchievementStandard.find params[:id]
---
SELECT "achievement_standards".* FROM "achievement_standards" WHERE "achievement_standards"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

    def update
        achievement_standard =  AchievementStandard.find params[:id]
---
SELECT "achievement_standards".* FROM "achievement_standards" WHERE "achievement_standards"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

    def destroy
        AchievementStandard.destroy params[:id]
---
DELETE FROM "achievement_standards" WHERE "achievement_standards"."id" = $1  [["id", 25]]