app/controllers/capabilities_controller.rb

INSERT INTO "capabilities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Literacy"], ["created_at", "2023-03-05 00:04:50.832910"], ["updated_at", "2023-03-05 00:04:50.832910"]]
---
    def create

        Capability.create capability_params

SELECT "capabilities".* FROM "capabilities"
---
    def index

        @capabilities = Capability.all

SELECT "capabilities".* FROM "capabilities" WHERE "capabilities"."id" = $1 LIMIT $2  [["id", 536], ["LIMIT", 1]]
---
    def edit

        @capability = Capability.find params[:id]

SELECT "capabilities".* FROM "capabilities" WHERE "capabilities"."id" = $1 LIMIT $2  [["id", 536], ["LIMIT", 1]]
UPDATE "capabilities" SET "name" = $1, "updated_at" = $2 WHERE "capabilities"."id" = $3  [["name", "Literacy2"], ["updated_at", "2023-03-05 00:00:40.037190"], ["id", 536]]
---
    def update
        @capability =  Capability.find params[:id]
        @capability.update capability_params

DELETE FROM "capabilities" WHERE "capabilities"."id" = $1  [["id", 536]]
---
    def destroy

        Capability.destroy params[:id]