app/controllers/class_groups_controller.rb

SELECT "class_groups".* FROM "class_groups"
---
    def index

        @class_group = ClassGroup.all

SELECT "class_groups".* FROM "class_groups" WHERE "class_groups"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
---
    def show

        @class_group = ClassGroup.find params[:id]

SELECT "class_groups".* FROM "class_groups" WHERE "class_groups"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
---
    def edit

        @class_group = ClassGroup.find params[:id]