app/controllers/content_descriptors_controller.rb

    def index

        @content_descriptors = ContentDescriptor.all
---
SELECT "content_descriptors".* FROM "content_descriptors"