app/controllers/session_controller.rb

  def create
    # This is the action to which the login form post request is posted.
    #It will add a user's id to the session hash, whhch will be used
    # for authentication and autherization
    # throughout the session
    user = User.find_by :email => params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nobody"], ["LIMIT", 1]]